<?php 

//分类
// 按目的地区域：国内、港澳台、出境、周边游、海岛
// 按区域：南极、北极、东南亚、美国、南美、非洲、欧洲、北欧、中亚、中东、澳新、
// 			日本、泰国、印度、斯里兰卡、马尔代夫、斐济、巴厘岛
// 按目的地类型：海岛、自然风光、人文、历史遗迹
// 按线路主题：长线、短线、探险、摄影、蜜月、度假、演出、比赛、自驾、研学、游学、夏令营、冬令营
// 按旅行方式：自驾、跟团、自由行、半自助、包团包车
// 按大交通方式：游轮(国内|出境)、专列(国内|出境)、火车/双卧(国内|出境)、双飞/单飞卧(国内|出境)、高铁/动车(国内)

// ？按住宿等级：三星、四星、五星


// 属性
// 1.目的地：国外 城市/景点列表
// 2.出发地：当地 城市列表
// 3.交通方式：交通方式列表
// 4.出行方式：跟团、半自助、自由行
// 5.住宿：星级列表1-5级
// 6.群体：群体列表
// 7.出发地机场接送：有/无
// 8.天数：枚举输入
// 9.购物：有/无
// 10.签证费：无/包含/不含[ ]
// 11.自费：有[ ]/无
// 12.主题：列表